// cspell:disable
import { Zekr } from "#types/content.model";

let vibrationTime = 100;
let pageInfoObj = {
  name: "alta3am",
  title: "أذكار الطعام والشراب",
  heartState: 0,
  url: "./alta3am.html",
  rememberMe: "8h",
  timerState: false,
};
export const _azkar_alta3am: Zekr[] = [
  {
    begin: "عند الطعام والشراب",
    content:
      "بِسْمِ اللهِ. فإنْ نسي في أَوَّلِهِ، فَليَقُلْ: بِسْمِ اللَّه أَوَّلَهُ وَآخِرَهُ.",
    count: 1,
  },
  {
    begin: "عند شرب اللبن",
    content: "اَللَّهُمَّ بَارِكْ لَنَا فِيهِ, وَزِدْنَا مِنْهُ.",
    count: 1,
  },
  {
    begin: "عند الفراغ من الطعام والشراب",
    content:
      "الْحَمْدُ للهِ الَّذِي أَطْعَمَنِي هَذَا, وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِّنِّي وَلاَ قُوَّةٍ. <br><br> الْحَمْدُ لِلَّهِ كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ غَيْرَ مَكْفِيٍّ وَلَا مُوَدَّعٍ وَلَا مُسْتَغْنًى عَنْهُ رَبَّنَا.",
    count: 1,
  },
  {
    begin: "عند الشرب",
    content:
      "كَانَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَشْرَبُ فِي ثَلاَثَةِ أَنْفَاسٍ، إِذَا أَدْنَى الإِنَاءَ إِلَى فَمِهِ سَمَّى اللهَ تَعَالَى, وَإِذَا أَخَّرَهُ حَمِدَ اللهَ تَعَالَى، يَفْعَلُ ذَلِكَ ثَلاَثَ مَرَّاتٍ.",
    count: 1,
  },
];
